; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 533266 2 1 2 6 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Star6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 infrared1)
	(have_image Phenomenon9 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 star6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star6)
   goals met: 0 of 5
4. (turn_to satellite1 star5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
5. (calibrate satellite1 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 5
6. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
7. (turn_to satellite1 planet8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
8. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
9. (take_image satellite1 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 1 of 5
10. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
11. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 5
12. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 3 of 5
13. (turn_to satellite0 planet7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
14. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 4 of 5
15. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 5
16. (take_image satellite0 phenomenon9 instrument0 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 5 of 5
